_posts/2021-10-16-boj-1251.html
---
title: BOJ 1251 단어 나누기
tags: STL
toc: true
toc_sticky: true
---

<div id="outline-container-orgdade493" class="outline-2">
<h2 id="orgdade493">BOJ 1251 단어 나누기</h2>
</div>

<div id="outline-container-org297f3ba" class="outline-2">
<h2 id="org297f3ba">접근하기</h2>
<div class="outline-text-2" id="text-org297f3ba">
<ul class="org-ul">
<li>단어를 3개의 조각으로 나누기</li>
<li>처음과 끝을 제외하고, 중간에 두 점을 정한다.</li>
</ul>
</div>
</div>

<div id="outline-container-org1b53432" class="outline-2">
<h2 id="org1b53432">코드 - STL string 이용</h2>
<div class="outline-text-2" id="text-org1b53432">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;string&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;algorithm&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;


<span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #edd400; font-weight: bold;">f</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">s</span>, <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">e</span>, <span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347;">ref</span>)
{
    <span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347;">tmp</span> = ref.substr(s, e-s+1);
    reverse(tmp.begin(), tmp.end());
    <span style="color: #729fcf; font-weight: bold;">return</span> tmp;
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    <span style="color: #8ae234; font-weight: bold;">char</span> <span style="color: #ff6347;">str</span>[60];
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%s"</span>, str);
    <span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347;">input</span>(str);
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span> = input.length();
    <span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347;">prev</span>(N, <span style="color: #ad7fa8; font-style: italic;">'z'</span>);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;N-1;i++) {
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">j</span>=i+1;j&lt;N;j++) {
            <span style="color: #729fcf; font-weight: bold;">if</span> (N-j&gt;=1) {
                <span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347;">tmp</span> = <span style="color: #ad7fa8; font-style: italic;">""</span>;
                tmp += f(0, i-1, input);
                tmp += f(i, j-1, input);
                tmp += f(j, N-1, input);
                <span style="color: #729fcf; font-weight: bold;">if</span> (prev &gt; tmp) {
                    prev = tmp;
                }
            }
        }
    }
    printf(<span style="color: #ad7fa8; font-style: italic;">"%s\n"</span>, prev.c_str());
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb256974" class="outline-2">
<h2 id="orgb256974">코드 - 그냥 구현</h2>
<div class="outline-text-2" id="text-orgb256974">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;stdio.h&gt;</span>

<span style="color: #8ae234; font-weight: bold;">char</span> <span style="color: #ff6347;">str</span>[60];
<span style="color: #8ae234; font-weight: bold;">char</span> <span style="color: #ff6347;">a</span>[60];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">idx</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>; 

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">my_strcmp</span>(<span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">p1</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">p2</span>)
{
    <span style="color: #729fcf; font-weight: bold;">while</span>(*p1 != <span style="color: #ad7fa8; font-style: italic;">'\0'</span> &amp;&amp; *p1 == *p2) {
        p1++;
        p2++;
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> (<span style="color: #8ae234; font-weight: bold;">int</span>)*p1 - (<span style="color: #8ae234; font-weight: bold;">int</span>)*p2;
}

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">my_strcpy</span>(<span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">p1</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">p2</span>)
{
    <span style="color: #729fcf; font-weight: bold;">while</span>(*p2 != <span style="color: #ad7fa8; font-style: italic;">'\0'</span>) {
        *p1 = *p2;
        p1++;
        p2++;
    }
    *p1 = <span style="color: #ad7fa8; font-style: italic;">'\0'</span>;
}

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">f</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">s</span>, <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">e</span>)
{
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=e;i&gt;=s;i--) {
        a[idx++] = str[i];
    }
    a[idx] = <span style="color: #ad7fa8; font-style: italic;">'\0'</span>;
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%s"</span>, str);
    <span style="color: #729fcf; font-weight: bold;">for</span>(N=0;str[N];N++);

    <span style="color: #8ae234; font-weight: bold;">char</span> <span style="color: #ff6347;">ret</span>[60];
    <span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #ff6347;">first</span> = <span style="color: #8ae234;">true</span>;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;N-1;i++) {
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">j</span>=i+1;j&lt;N;j++) {
            <span style="color: #729fcf; font-weight: bold;">if</span> (N-j&gt;=1) {
                idx = 0;
                f(0, i-1);
                f(i, j-1);
                f(j, N-1);
                <span style="color: #729fcf; font-weight: bold;">if</span> (first) {
                    my_strcpy(ret, a);
                    first = <span style="color: #8ae234;">false</span>;
                } <span style="color: #729fcf; font-weight: bold;">else</span> {
                    <span style="color: #729fcf; font-weight: bold;">if</span> (my_strcmp(a, ret) &lt; 0) {
                        my_strcpy(ret, a);
                    }              
                }
            }
        }
    }
    printf(<span style="color: #ad7fa8; font-style: italic;">"%s\n"</span>, ret);
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org0164e52" class="outline-2">
<h2 id="org0164e52">문제 링크</h2>
<div class="outline-text-2" id="text-org0164e52">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/1251">https://www.acmicpc.net/problem/1251</a></li>
</ul>
</div>
</div>
